Revit 2024 API
MechanicalUtils.ConnectDuctPlaceholdersAtCross Method
Overload List
Name | Description
ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId)
 Connects a pair of placeholders that can intersect in a Cross connection.
ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId, ElementId)
 Connects a trio of placeholders that can intersect in a Cross connection.
ConnectDuctPlaceholdersAtCross(Document, Connector, Connector, Connector, Connector)
 Connects a group of placeholders that can intersect in a Cross connection.
See Also
MechanicalUtils Class
MechanicalUtils Members
Autodesk.Revit.DB.Mechanical Namespace